docs(README.md): Update some diagrams
Update partial Notebook 10 Optuna full run results (still running).
